# Main Menu commands
MENU_COMMANDS = {
    '/start': '🟢 Getting started with the bot',
    '/help': 'ℹ Help',
    '/cancel': '🔴 Stop',
}

# Bot messages
BOT_MESSAGES = {
    'start': '✋ Вітаю! Я погодний бот!\n'
             'Для якої локації вам потрібен прогноз погоди?',
    'location': '🔽 Введіть місто та/чи поштовий індекс',
    'location_complete': '✅ Локацію отримано',
    'weather_type': '🔽 Оберіть опцію:',
    'wait': '⏱️️ Зачекайте, обробляється запит...',
    'warning': '⚠️ Сталася помилка під час обробки запиту.',
    'current_weather': '📌 Ось поточна погода:\n',
    'forecast': '📌 Ось прогноз погоди:\n',
    'help': f'ℹ️ Даний бот може визначити поточну погоду, а також надати прогноз на 3 дні.\n'
            f'Для початку роботи з ботом використовуйте команду /start',
    'stop': f'🔴 Скасовано.\n',
    'error': '⚠ Виникла помилка',
    'unknown': f'Невідома команда 🥲\n'
               f'Використовуйте команди /start або /help для роботи з ботом',
}
